FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_supc.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM_SUPC_COMPONENT_
#define _SAM_SUPC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Supply Controller */
/* ============================================================================= */
/** \addtogroup SAM_SUPC Supply Controller */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief Supc hardware registers */
    typedef struct
    {
        __O uint32_t SUPC_CR;      /**< \brief (Supc Offset: 0x00) Supply Controller Control Register */
        __IO uint32_t SUPC_SMMR;   /**< \brief (Supc Offset: 0x04) Supply Controller Supply Monitor Mode Register */
        __IO uint32_t SUPC_MR;     /**< \brief (Supc Offset: 0x08) Supply Controller Mode Register */
        __IO uint32_t SUPC_WUMR;   /**< \brief (Supc Offset: 0x0C) Supply Controller Wake-up Mode Register */
        __IO uint32_t SUPC_WUIR;   /**< \brief (Supc Offset: 0x10) Supply Controller Wake-up Inputs Register */
        __I uint32_t SUPC_SR;      /**< \brief (Supc Offset: 0x14) Supply Controller Status Register */
        __I uint32_t Reserved1[ 57 ];
        __I uint32_t SYSC_VERSION; /**< \brief (Supc Offset: 0xFC) Version Register */
    } Supc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- SUPC_CR : (SUPC Offset: 0x00) Supply Controller Control Register -------- */
#define SUPC_CR_VROFF                      ( 0x1u << 2 )                /**< \brief (SUPC_CR) Voltage Regulator Off */
#define   SUPC_CR_VROFF_NO_EFFECT          ( 0x0u << 2 )                /**< \brief (SUPC_CR) No effect. */
#define   SUPC_CR_VROFF_STOP_VREG          ( 0x1u << 2 )                /**< \brief (SUPC_CR) If KEY is correct, asserts the vddcore_nreset and stops the voltage regulator. */
#define SUPC_CR_XTALSEL                    ( 0x1u << 3 )                /**< \brief (SUPC_CR) Crystal Oscillator Select */
#define   SUPC_CR_XTALSEL_NO_EFFECT        ( 0x0u << 3 )                /**< \brief (SUPC_CR) No effect. */
#define   SUPC_CR_XTALSEL_CRYSTAL_SEL      ( 0x1u << 3 )                /**< \brief (SUPC_CR) If KEY is correct, switches the slow clock on the crystal oscillator output. */
#define SUPC_CR_KEY_Pos                    24
#define SUPC_CR_KEY_Msk                    ( 0xffu << SUPC_CR_KEY_Pos ) /**< \brief (SUPC_CR) Password */
#define   SUPC_CR_KEY_PASSWD               ( 0xA5u << 24 )              /**< \brief (SUPC_CR) Writing any other value in this field aborts the write operation. */
/* -------- SUPC_SMMR : (SUPC Offset: 0x04) Supply Controller Supply Monitor Mode Register -------- */
#define SUPC_SMMR_SMTH_Pos                 0
#define SUPC_SMMR_SMTH_Msk                 ( 0xfu << SUPC_SMMR_SMTH_Pos ) /**< \brief (SUPC_SMMR) Supply Monitor Threshold */
#define SUPC_SMMR_SMTH( value )    ( ( SUPC_SMMR_SMTH_Msk & ( ( value ) << SUPC_SMMR_SMTH_Pos ) ) )
#define SUPC_SMMR_SMSMPL_Pos               8
#define SUPC_SMMR_SMSMPL_Msk               ( 0x7u << SUPC_SMMR_SMSMPL_Pos )  /**< \brief (SUPC_SMMR) Supply Monitor Sampling Period */
#define   SUPC_SMMR_SMSMPL_SMD             ( 0x0u << 8 )                     /**< \brief (SUPC_SMMR) Supply Monitor disabled */
#define   SUPC_SMMR_SMSMPL_CSM             ( 0x1u << 8 )                     /**< \brief (SUPC_SMMR) Continuous Supply Monitor */
#define   SUPC_SMMR_SMSMPL_32SLCK          ( 0x2u << 8 )                     /**< \brief (SUPC_SMMR) Supply Monitor enabled one SLCK period every 32 SLCK periods */
#define   SUPC_SMMR_SMSMPL_256SLCK         ( 0x3u << 8 )                     /**< \brief (SUPC_SMMR) Supply Monitor enabled one SLCK period every 256 SLCK periods */
#define   SUPC_SMMR_SMSMPL_2048SLCK        ( 0x4u << 8 )                     /**< \brief (SUPC_SMMR) Supply Monitor enabled one SLCK period every 2,048 SLCK periods */
#define SUPC_SMMR_SMRSTEN                  ( 0x1u << 12 )                    /**< \brief (SUPC_SMMR) Supply Monitor Reset Enable */
#define   SUPC_SMMR_SMRSTEN_NOT_ENABLE     ( 0x0u << 12 )                    /**< \brief (SUPC_SMMR) The core reset signal "vddcore_nreset" is not affected when a supply monitor detection occurs. */
#define   SUPC_SMMR_SMRSTEN_ENABLE         ( 0x1u << 12 )                    /**< \brief (SUPC_SMMR) The core reset signal, vddcore_nreset is asserted when a supply monitor detection occurs. */
#define SUPC_SMMR_SMIEN                    ( 0x1u << 13 )                    /**< \brief (SUPC_SMMR) Supply Monitor Interrupt Enable */
#define   SUPC_SMMR_SMIEN_NOT_ENABLE       ( 0x0u << 13 )                    /**< \brief (SUPC_SMMR) The SUPC interrupt signal is not affected when a supply monitor detection occurs. */
#define   SUPC_SMMR_SMIEN_ENABLE           ( 0x1u << 13 )                    /**< \brief (SUPC_SMMR) The SUPC interrupt signal is asserted when a supply monitor detection occurs. */
/* -------- SUPC_MR : (SUPC Offset: 0x08) Supply Controller Mode Register -------- */
#define SUPC_MR_BODRSTEN                   ( 0x1u << 12 )                    /**< \brief (SUPC_MR) Brownout Detector Reset Enable */
#define   SUPC_MR_BODRSTEN_NOT_ENABLE      ( 0x0u << 12 )                    /**< \brief (SUPC_MR) The core reset signal "vddcore_nreset" is not affected when a brownout detection occurs. */
#define   SUPC_MR_BODRSTEN_ENABLE          ( 0x1u << 12 )                    /**< \brief (SUPC_MR) The core reset signal, vddcore_nreset is asserted when a brownout detection occurs. */
#define SUPC_MR_BODDIS                     ( 0x1u << 13 )                    /**< \brief (SUPC_MR) Brownout Detector Disable */
#define   SUPC_MR_BODDIS_ENABLE            ( 0x0u << 13 )                    /**< \brief (SUPC_MR) The core brownout detector is enabled. */
#define   SUPC_MR_BODDIS_DISABLE           ( 0x1u << 13 )                    /**< \brief (SUPC_MR) The core brownout detector is disabled. */
#define SUPC_MR_ONREG                      ( 0x1u << 14 )                    /**< \brief (SUPC_MR) Voltage Regulator Enable */
#define   SUPC_MR_ONREG_ONREG_UNUSED       ( 0x0u << 14 )                    /**< \brief (SUPC_MR) Internal voltage regulator is not used (external power supply is used). */
#define   SUPC_MR_ONREG_ONREG_USED         ( 0x1u << 14 )                    /**< \brief (SUPC_MR) Internal voltage regulator is used. */
#define SUPC_MR_OSCBYPASS                  ( 0x1u << 20 )                    /**< \brief (SUPC_MR) Oscillator Bypass */
#define   SUPC_MR_OSCBYPASS_NO_EFFECT      ( 0x0u << 20 )                    /**< \brief (SUPC_MR) No effect. Clock selection depends on XTALSEL value. */
#define   SUPC_MR_OSCBYPASS_BYPASS         ( 0x1u << 20 )                    /**< \brief (SUPC_MR) The 32 kHz crystal oscillator is selected and put in bypass mode. */
#define SUPC_MR_KEY_Pos                    24
#define SUPC_MR_KEY_Msk                    ( 0xffu << SUPC_MR_KEY_Pos )      /**< \brief (SUPC_MR) Password Key */
#define   SUPC_MR_KEY_PASSWD               ( 0xA5u << 24 )                   /**< \brief (SUPC_MR) Writing any other value in this field aborts the write operation. */
/* -------- SUPC_WUMR : (SUPC Offset: 0x0C) Supply Controller Wake-up Mode Register -------- */
#define SUPC_WUMR_SMEN                     ( 0x1u << 1 )                     /**< \brief (SUPC_WUMR) Supply Monitor Wake-up Enable */
#define   SUPC_WUMR_SMEN_NOT_ENABLE        ( 0x0u << 1 )                     /**< \brief (SUPC_WUMR) The supply monitor detection has no wake-up effect. */
#define   SUPC_WUMR_SMEN_ENABLE            ( 0x1u << 1 )                     /**< \brief (SUPC_WUMR) The supply monitor detection forces the wake-up of the core power supply. */
#define SUPC_WUMR_RTTEN                    ( 0x1u << 2 )                     /**< \brief (SUPC_WUMR) Real-time Timer Wake-up Enable */
#define   SUPC_WUMR_RTTEN_NOT_ENABLE       ( 0x0u << 2 )                     /**< \brief (SUPC_WUMR) The RTT alarm signal has no wake-up effect. */
#define   SUPC_WUMR_RTTEN_ENABLE           ( 0x1u << 2 )                     /**< \brief (SUPC_WUMR) The RTT alarm signal forces the wake-up of the core power supply. */
#define SUPC_WUMR_RTCEN                    ( 0x1u << 3 )                     /**< \brief (SUPC_WUMR) Real-time Clock Wake-up Enable */
#define   SUPC_WUMR_RTCEN_NOT_ENABLE       ( 0x0u << 3 )                     /**< \brief (SUPC_WUMR) The RTC alarm signal has no wake-up effect. */
#define   SUPC_WUMR_RTCEN_ENABLE           ( 0x1u << 3 )                     /**< \brief (SUPC_WUMR) The RTC alarm signal forces the wake-up of the core power supply. */
#define SUPC_WUMR_LPDBCEN0                 ( 0x1u << 5 )                     /**< \brief (SUPC_WUMR) Low Power Debouncer Enable WKUP0 */
#define   SUPC_WUMR_LPDBCEN0_NOT_ENABLE    ( 0x0u << 5 )                     /**< \brief (SUPC_WUMR) The WKUP0 input pin is not connected with low power debouncer. */
#define   SUPC_WUMR_LPDBCEN0_ENABLE        ( 0x1u << 5 )                     /**< \brief (SUPC_WUMR) The WKUP0 input pin is connected with low power debouncer and can force a core wake-up. */
#define SUPC_WUMR_LPDBCEN1                 ( 0x1u << 6 )                     /**< \brief (SUPC_WUMR) Low Power Debouncer Enable WKUP1 */
#define   SUPC_WUMR_LPDBCEN1_NOT_ENABLE    ( 0x0u << 6 )                     /**< \brief (SUPC_WUMR) The WKUP1 input pin is not connected with low power debouncer. */
#define   SUPC_WUMR_LPDBCEN1_ENABLE        ( 0x1u << 6 )                     /**< \brief (SUPC_WUMR) The WKUP1 input pin is connected with low power debouncer and can force a core wake-up. */
#define SUPC_WUMR_LPDBCCLR                 ( 0x1u << 7 )                     /**< \brief (SUPC_WUMR) Low Power Debouncer Clear */
#define   SUPC_WUMR_LPDBCCLR_NOT_ENABLE    ( 0x0u << 7 )                     /**< \brief (SUPC_WUMR) A low power debounce event does not create an immediate clear on the first half of GPBR registers. */
#define   SUPC_WUMR_LPDBCCLR_ENABLE        ( 0x1u << 7 )                     /**< \brief (SUPC_WUMR) A low power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers. */
#define SUPC_WUMR_WKUPDBC_Pos              12
#define SUPC_WUMR_WKUPDBC_Msk              ( 0x7u << SUPC_WUMR_WKUPDBC_Pos ) /**< \brief (SUPC_WUMR) Wake-up Inputs Debouncer Period */
#define   SUPC_WUMR_WKUPDBC_IMMEDIATE      ( 0x0u << 12 )                    /**< \brief (SUPC_WUMR) Immediate, no debouncing, detected active at least on one Slow Clock edge. */
#define   SUPC_WUMR_WKUPDBC_3_SCLK         ( 0x1u << 12 )                    /**< \brief (SUPC_WUMR) WKUPx shall be in its active state for at least 3 SLCK periods */
#define   SUPC_WUMR_WKUPDBC_32_SCLK        ( 0x2u << 12 )                    /**< \brief (SUPC_WUMR) WKUPx shall be in its active state for at least 32 SLCK periods */
#define   SUPC_WUMR_WKUPDBC_512_SCLK       ( 0x3u << 12 )                    /**< \brief (SUPC_WUMR) WKUPx shall be in its active state for at least 512 SLCK periods */
#define   SUPC_WUMR_WKUPDBC_4096_SCLK      ( 0x4u << 12 )                    /**< \brief (SUPC_WUMR) WKUPx shall be in its active state for at least 4,096 SLCK periods */
#define   SUPC_WUMR_WKUPDBC_32768_SCLK     ( 0x5u << 12 )                    /**< \brief (SUPC_WUMR) WKUPx shall be in its active state for at least 32,768 SLCK periods */
#define SUPC_WUMR_LPDBC_Pos                16
#define SUPC_WUMR_LPDBC_Msk                ( 0x7u << SUPC_WUMR_LPDBC_Pos )   /**< \brief (SUPC_WUMR) Low Power Debouncer Period */
#define   SUPC_WUMR_LPDBC_DISABLE          ( 0x0u << 16 )                    /**< \brief (SUPC_WUMR) Disable the low power debouncers. */
#define   SUPC_WUMR_LPDBC_2_RTCOUT0        ( 0x1u << 16 )                    /**< \brief (SUPC_WUMR) WKUP0/1 in active state for at least 2 RTCOUT0 periods */
#define   SUPC_WUMR_LPDBC_3_RTCOUT0        ( 0x2u << 16 )                    /**< \brief (SUPC_WUMR) WKUP0/1 in active state for at least 3 RTCOUT0 periods */
#define   SUPC_WUMR_LPDBC_4_RTCOUT0        ( 0x3u << 16 )                    /**< \brief (SUPC_WUMR) WKUP0/1 in active state for at least 4 RTCOUT0 periods */
#define   SUPC_WUMR_LPDBC_5_RTCOUT0        ( 0x4u << 16 )                    /**< \brief (SUPC_WUMR) WKUP0/1 in active state for at least 5 RTCOUT0 periods */
#define   SUPC_WUMR_LPDBC_6_RTCOUT0        ( 0x5u << 16 )                    /**< \brief (SUPC_WUMR) WKUP0/1 in active state for at least 6 RTCOUT0 periods */
#define   SUPC_WUMR_LPDBC_7_RTCOUT0        ( 0x6u << 16 )                    /**< \brief (SUPC_WUMR) WKUP0/1 in active state for at least 7 RTCOUT0 periods */
#define   SUPC_WUMR_LPDBC_8_RTCOUT0        ( 0x7u << 16 )                    /**< \brief (SUPC_WUMR) WKUP0/1 in active state for at least 8 RTCOUT0 periods */
/* -------- SUPC_WUIR : (SUPC Offset: 0x10) Supply Controller Wake-up Inputs Register -------- */
#define SUPC_WUIR_WKUPEN0                  ( 0x1u << 0 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 0 */
#define   SUPC_WUIR_WKUPEN0_DISABLE        ( 0x0u << 0 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN0_ENABLE         ( 0x1u << 0 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN1                  ( 0x1u << 1 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 1 */
#define   SUPC_WUIR_WKUPEN1_DISABLE        ( 0x0u << 1 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN1_ENABLE         ( 0x1u << 1 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN2                  ( 0x1u << 2 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 2 */
#define   SUPC_WUIR_WKUPEN2_DISABLE        ( 0x0u << 2 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN2_ENABLE         ( 0x1u << 2 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN3                  ( 0x1u << 3 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 3 */
#define   SUPC_WUIR_WKUPEN3_DISABLE        ( 0x0u << 3 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN3_ENABLE         ( 0x1u << 3 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN4                  ( 0x1u << 4 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 4 */
#define   SUPC_WUIR_WKUPEN4_DISABLE        ( 0x0u << 4 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN4_ENABLE         ( 0x1u << 4 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN5                  ( 0x1u << 5 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 5 */
#define   SUPC_WUIR_WKUPEN5_DISABLE        ( 0x0u << 5 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN5_ENABLE         ( 0x1u << 5 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN6                  ( 0x1u << 6 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 6 */
#define   SUPC_WUIR_WKUPEN6_DISABLE        ( 0x0u << 6 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN6_ENABLE         ( 0x1u << 6 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN7                  ( 0x1u << 7 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 7 */
#define   SUPC_WUIR_WKUPEN7_DISABLE        ( 0x0u << 7 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN7_ENABLE         ( 0x1u << 7 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN8                  ( 0x1u << 8 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 8 */
#define   SUPC_WUIR_WKUPEN8_DISABLE        ( 0x0u << 8 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN8_ENABLE         ( 0x1u << 8 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN9                  ( 0x1u << 9 )                     /**< \brief (SUPC_WUIR) Wake-up Input Enable 9 */
#define   SUPC_WUIR_WKUPEN9_DISABLE        ( 0x0u << 9 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN9_ENABLE         ( 0x1u << 9 )                     /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN10                 ( 0x1u << 10 )                    /**< \brief (SUPC_WUIR) Wake-up Input Enable 10 */
#define   SUPC_WUIR_WKUPEN10_DISABLE       ( 0x0u << 10 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN10_ENABLE        ( 0x1u << 10 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN11                 ( 0x1u << 11 )                    /**< \brief (SUPC_WUIR) Wake-up Input Enable 11 */
#define   SUPC_WUIR_WKUPEN11_DISABLE       ( 0x0u << 11 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN11_ENABLE        ( 0x1u << 11 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN12                 ( 0x1u << 12 )                    /**< \brief (SUPC_WUIR) Wake-up Input Enable 12 */
#define   SUPC_WUIR_WKUPEN12_DISABLE       ( 0x0u << 12 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN12_ENABLE        ( 0x1u << 12 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN13                 ( 0x1u << 13 )                    /**< \brief (SUPC_WUIR) Wake-up Input Enable 13 */
#define   SUPC_WUIR_WKUPEN13_DISABLE       ( 0x0u << 13 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN13_ENABLE        ( 0x1u << 13 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN14                 ( 0x1u << 14 )                    /**< \brief (SUPC_WUIR) Wake-up Input Enable 14 */
#define   SUPC_WUIR_WKUPEN14_DISABLE       ( 0x0u << 14 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN14_ENABLE        ( 0x1u << 14 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPEN15                 ( 0x1u << 15 )                    /**< \brief (SUPC_WUIR) Wake-up Input Enable 15 */
#define   SUPC_WUIR_WKUPEN15_DISABLE       ( 0x0u << 15 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input has no wake-up effect. */
#define   SUPC_WUIR_WKUPEN15_ENABLE        ( 0x1u << 15 )                    /**< \brief (SUPC_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT0                   ( 0x1u << 16 )                    /**< \brief (SUPC_WUIR) Wake-up Input Type 0 */
#define   SUPC_WUIR_WKUPT0_LOW             ( 0x0u << 16 )                    /**< \brief (SUPC_WUIR) A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT0_HIGH            ( 0x1u << 16 )                    /**< \brief (SUPC_WUIR) A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT1                   ( 0x1u << 17 )                    /**< \brief (SUPC_WUIR) Wake-up Input Type 1 */
#define   SUPC_WUIR_WKUPT1_LOW             ( 0x0u << 17 )                    /**< \brief (SUPC_WUIR) A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT1_HIGH            ( 0x1u << 17 )                    /**< \brief (SUPC_WUIR) A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT2                   ( 0x1u << 18 )                    /**< \brief (SUPC_WUIR) Wake-up Input Type 2 */
